{
  "comments": [
    {
      "postId": "P1",
      "comments": [
        {
          "parentId": "",
          "id": "P1-0001",
          "comment": "Ne est percipit periculis. Graeci aliquid ei est, mea id meis posse luptatum."
        },
        {
          "parentId": "P1-0001",
          "id": "P1-0011",
          "comment": "Summo doctus menandri ea usu, mutat harum copiosae ea nec."
        },
        {
          "parentId": "",
          "id": "P1-0002",
          "comment": "Nec debitis dissentias cu, an pericula sadipscing referrentur sea, ut sed zril iudico munere."
        }
      ]
    },
    {
      "postId": "P2",
      "comments": [
        {
          "parentId": "",
          "id": "P2-0001",
          "comment": "Usu ea utroque commune assueverit, at eos laoreet quaestio, ut mei oporteat salutatus. Pro tantas conclusionemque ne."
        },
        {
          "parentId": "P2-0001",
          "id": "P2-0011",
          "comment": "Dicat nostrud pro in, sonet sapientem intellegat qui eu, tota putent mel id. Ei decore gubergren usu, eu regione tamquam his."
        },
        {
          "parentId": "P2-0011",
          "id": "P2-0111",
          "comment": "Ut duo brute verterem, nec tale fabulas ei. Docendi prodesset vituperata est no, veri assueverit mei in, ea voluptua convenire sea. "
        },
        {
          "parentId": "P2-0011",
          "id": "P2-0112",
          "comment": "Cu nec quidam equidem eloquentiam, no sea diceret graecis menandri. Quo prompta suscipiantur eu."
        },
        {
          "parentId": "",
          "id": "P2-0002",
          "comment": "Viderer cotidieque ex usu, cum virtute splendide cu. Solet laoreet ut qui."
        },
        {
          "parentId": "P2-0002",
          "id": "P2-0021",
          "comment": "Ei nam omnes meliore delectus, quas postea urbanitas mea ad."
        }
      ]
    },
    {
      "postId": "P3",
      "comments": []
    },
    {
      "postId": "P4",
      "comments": [
        {
          "parentId": "",
          "id": "P4-0001",
          "comment": "Id quaerendum consequuntur qui."
        },
        {
          "parentId": "",
          "id": "P4-0002",
          "comment": "Ne vim doming voluptatum constituam, erat aeterno dissentiet mei an, sea no homero aperiri blandit."
        },
        {
          "parentId": "",
          "id": "P4-0003",
          "comment": "Id inimicus adipiscing disputationi vel, ipsum cetero delicatissimi ei pro, ferri vitae patrioque ex vix. Modus doctus per ne, est ea aperiam blandit appareat."
        }
      ]
    },
    {
      "postId": "P5",
      "comments": [
        {
          "parentId": "",
          "id": "P5-0001",
          "comment": "Sed an omnis omittam fastidii, in cum alterum nonumes."
        }
      ]
    },
    {
      "postId": "P6",
      "comments": []
    }
  ]
}
